{
  "token_to_idx": {
    "\n": 0,
    " ": 1,
    "    ": 2,
    "!": 3,
    "!=": 4,
    "%": 5,
    "&": 6,
    "&&": 7,
    "' '": 8,
    "'!'": 9,
    "','": 10,
    "'.'": 11,
    "'0'": 12,
    "'7'": 13,
    "'9'": 14,
    "':'": 15,
    "';'": 16,
    "'?'": 17,
    "'A'": 18,
    "'E'": 19,
    "'F'": 20,
    "'I'": 21,
    "'O'": 22,
    "'U'": 23,
    "'Z'": 24,
    "'\\0'": 25,
    "'\\n'": 26,
    "'\\r'": 27,
    "'\\t'": 28,
    "'_'": 29,
    "'a'": 30,
    "'e'": 31,
    "'f'": 32,
    "'i'": 33,
    "'o'": 34,
    "'u'": 35,
    "'z'": 36,
    "(": 37,
    ")": 38,
    "*": 39,
    "+": 40,
    "++": 41,
    ",": 42,
    "-": 43,
    "--": 44,
    "/": 45,
    "// Agrega el contenido de una cadena al final de otra cadena destino.": 46,
    "// Alterna un bit específico en un entero.": 47,
    "// Asigna un valor entero a la dirección de memoria apuntada.": 48,
    "// Aumenta un número en uno.": 49,
    "// Busca un valor en un arreglo ordenado usando búsqueda binaria.": 50,
    "// Busca un valor específico en un bloque de memoria simulado.": 51,
    "// Calcula el bit de acarreo de un semisumador.": 52,
    "// Calcula el bit de suma de un semisumador.": 53,
    "// Calcula el coeficiente de variación porcentual aproximado.": 54,
    "// Calcula el cuadrado de la hipotenusa de un triángulo rectángulo.": 55,
    "// Calcula el discriminante de una ecuación de segundo grado.": 56,
    "// Calcula el factorial de un número.": 57,
    "// Calcula el interés simple acumulado.": 58,
    "// Calcula el monto total con interés simple.": 59,
    "// Calcula el máximo común divisor.": 60,
    "// Calcula el mínimo común múltiplo.": 61,
    "// Calcula el módulo de los valores apuntados por dos punteros.": 62,
    "// Calcula el n-ésimo término de una progresión aritmética.": 63,
    "// Calcula el n-ésimo término de una progresión geométrica.": 64,
    "// Calcula el número de diagonales de un polígono de n lados.": 65,
    "// Calcula el perímetro aproximado de un círculo usando pi como 3.": 66,
    "// Calcula el perímetro de un cuadrado.": 67,
    "// Calcula el perímetro de un rectángulo.": 68,
    "// Calcula el perímetro de un rombo.": 69,
    "// Calcula el perímetro de un trapecio.": 70,
    "// Calcula el perímetro de un triángulo.": 71,
    "// Calcula el porcentaje de una cantidad.": 72,
    "// Calcula el precio final tras aplicar un porcentaje de descuento.": 73,
    "// Calcula el producto de todos los elementos de un arreglo.": 74,
    "// Calcula el producto punto de dos arreglos.": 75,
    "// Calcula el promedio de los elementos del arreglo.": 76,
    "// Calcula el volumen aproximado de un cilindro usando pi como 3.": 77,
    "// Calcula el volumen aproximado de una esfera usando pi como 3.": 78,
    "// Calcula el volumen de un cubo.": 79,
    "// Calcula el volumen de un prisma rectangular.": 80,
    "// Calcula el ángulo interno de un polígono regular de n lados.": 81,
    "// Calcula el área aproximada de un círculo usando pi como 3.": 82,
    "// Calcula el área de un cuadrado.": 83,
    "// Calcula el área de un hexágono regular.": 84,
    "// Calcula el área de un pentágono regular.": 85,
    "// Calcula el área de un rectángulo.": 86,
    "// Calcula el área de un rombo.": 87,
    "// Calcula el área de un trapecio.": 88,
    "// Calcula el área de un triángulo.": 89,
    "// Calcula la cantidad de unidades para el punto de equilibrio.": 90,
    "// Calcula la diferencia absoluta entre dos números.": 91,
    "// Calcula la diferencia entre el tercer y primer cuartil.": 92,
    "// Calcula la diferencia entre el valor máximo y el valor mínimo del arreglo.": 93,
    "// Calcula la ganancia neta restando costos de ingresos.": 94,
    "// Calcula la longitud de una cadena de texto.": 95,
    "// Calcula la media armónica aproximada de dos enteros.": 96,
    "// Calcula la potencia de una base.": 97,
    "// Calcula la raíz cuadrada entera aproximada.": 98,
    "// Calcula la suma de los elementos del arreglo.": 99,
    "// Calcula la suma de los primeros n números naturales.": 100,
    "// Calcula la suma de los ángulos internos de un polígono de n lados.": 101,
    "// Calcula la suma máxima de un subarreglo contiguo.": 102,
    "// Calcula la variación porcentual entre dos valores.": 103,
    "// Cifra una cadena aplicando un desplazamiento César a las letras minúsculas.": 104,
    "// Combina los 16 bits inferiores de dos números en un solo entero.": 105,
    "// Compara dos bloques de memoria simulados entero a entero.": 106,
    "// Compara dos cadenas alfabéticamente.": 107,
    "// Comprueba si dos arreglos tienen los mismos elementos en el mismo orden.": 108,
    "// Comprueba si dos cadenas son exactamente iguales.": 109,
    "// Comprueba si dos cadenas tienen los mismos caracteres con la misma frecuencia.": 110,
    "// Comprueba si dos números están dentro de un margen de tolerancia.": 111,
    "// Comprueba si dos punteros apuntan a la misma dirección de memoria.": 112,
    "// Comprueba si dos valores de verdad son equivalentes.": 113,
    "// Comprueba si el arreglo es simétrico.": 114,
    "// Comprueba si hay al menos un elemento duplicado en el arreglo.": 115,
    "// Comprueba si los ingresos superan estrictamente a los costos.": 116,
    "// Comprueba si todos los elementos de una matriz son cero.": 117,
    "// Comprueba si un arreglo está ordenado ascendentemente.": 118,
    "// Comprueba si un bit específico está establecido.": 119,
    "// Comprueba si un carácter es letra o dígito.": 120,
    "// Comprueba si un carácter es un dígito octal válido.": 121,
    "// Comprueba si un carácter es un espacio en blanco o tabulación.": 122,
    "// Comprueba si un carácter es un número.": 123,
    "// Comprueba si un carácter es un signo de puntuación básico.": 124,
    "// Comprueba si un carácter es una letra mayúscula.": 125,
    "// Comprueba si un carácter es una letra minúscula.": 126,
    "// Comprueba si un carácter es una letra.": 127,
    "// Comprueba si un carácter es válido en base hexadecimal.": 128,
    "// Comprueba si un carácter existe en una cadena.": 129,
    "// Comprueba si un carácter individual es una consonante.": 130,
    "// Comprueba si un carácter individual es una vocal.": 131,
    "// Comprueba si un entero positivo es una potencia de dos.": 132,
    "// Comprueba si un número entero es primo.": 133,
    "// Comprueba si un número entero es un cuadrado perfecto.": 134,
    "// Comprueba si un número entero es un cubo perfecto.": 135,
    "// Comprueba si un número es divisible por otro.": 136,
    "// Comprueba si un número es estrictamente negativo.": 137,
    "// Comprueba si un número es estrictamente positivo.": 138,
    "// Comprueba si un número es igual a cero.": 139,
    "// Comprueba si un número es impar usando operaciones de bits.": 140,
    "// Comprueba si un número es impar.": 141,
    "// Comprueba si un número es múltiplo de otro.": 142,
    "// Comprueba si un número es par usando operaciones de bits.": 143,
    "// Comprueba si un número es par.": 144,
    "// Comprueba si un puntero es nulo.": 145,
    "// Comprueba si un valor existe en un arreglo.": 146,
    "// Comprueba si una cadena comienza con un prefijo específico.": 147,
    "// Comprueba si una cadena contiene al menos 26 letras alfabéticas distintas.": 148,
    "// Comprueba si una cadena de texto está vacía.": 149,
    "// Comprueba si una cadena no tiene letras repetidas.": 150,
    "// Comprueba si una cadena se lee igual de izquierda a derecha que al revés.": 151,
    "// Comprueba si una cadena termina con un sufijo específico.": 152,
    "// Comprueba si una ecuación cuadrática tiene raíces reales.": 153,
    "// Comprueba si una matriz cuadrada es una matriz identidad.": 154,
    "// Convierte todos los caracteres de una cadena a mayúsculas.": 155,
    "// Convierte todos los caracteres de una cadena a minúsculas.": 156,
    "// Convierte un carácter a mayúscula.": 157,
    "// Convierte un carácter a minúscula.": 158,
    "// Convierte un carácter numérico a su valor entero.": 159,
    "// Copia como máximo n caracteres de origen a destino.": 160,
    "// Copia datos de un bloque origen a un destino simulado con arreglos.": 161,
    "// Copia el contenido de una cadena origen a una cadena destino.": 162,
    "// Copia el valor de una dirección de memoria a otra.": 163,
    "// Copia elementos de origen a destino.": 164,
    "// Copia una porción de un arreglo origen a un arreglo destino.": 165,
    "// Corta una cadena a una longitud máxima especificada.": 166,
    "// Cuenta caracteres de puntuación en una cadena.": 167,
    "// Cuenta cuántas letras mayúsculas hay en una cadena.": 168,
    "// Cuenta cuántas letras minúsculas hay en una cadena.": 169,
    "// Cuenta cuántas veces aparece un valor en un arreglo.": 170,
    "// Cuenta cuántas veces aparece una subcadena en una cadena principal.": 171,
    "// Cuenta cuántos bits están en 0 en los 32 bits de un entero.": 172,
    "// Cuenta cuántos bits están establecidos en 1 en un entero.": 173,
    "// Cuenta cuántos caracteres alfabéticos hay en una cadena.": 174,
    "// Cuenta cuántos caracteres numéricos hay en una cadena.": 175,
    "// Cuenta cuántos ceros hay en un arreglo.": 176,
    "// Cuenta cuántos elementos del primer arreglo no están en el segundo.": 177,
    "// Cuenta cuántos elementos en común tienen dos arreglos.": 178,
    "// Cuenta cuántos espacios en blanco hay en una cadena.": 179,
    "// Cuenta cuántos números estrictamente negativos hay en un arreglo.": 180,
    "// Cuenta cuántos números estrictamente positivos hay en un arreglo.": 181,
    "// Cuenta el número de consonantes en una cadena.": 182,
    "// Cuenta el número de vocales en una cadena.": 183,
    "// Cuenta las ocurrencias de un carácter en una cadena.": 184,
    "// Cuenta los elementos mayores que un umbral especificado.": 185,
    "// Cuenta los elementos menores que un umbral especificado.": 186,
    "// Cuenta los elementos que están dentro de un rango.": 187,
    "// Cuenta los elementos que no son cero en un arreglo.": 188,
    "// Cuenta los números impares en un arreglo.": 189,
    "// Cuenta los números pares en un arreglo.": 190,
    "// Decrementa el valor al que se apunta.": 191,
    "// Descifra una cadena aplicando un desplazamiento César inverso a minúsculas.": 192,
    "// Desplaza elementos a la derecha rellenando con cero al inicio.": 193,
    "// Desplaza elementos a la izquierda rellenando con cero al final.": 194,
    "// Desplaza elementos e inserta un valor en un índice específico.": 195,
    "// Desplaza elementos para sobrescribir un índice específico.": 196,
    "// Desplaza los bits de un número hacia la derecha.": 197,
    "// Desplaza los bits de un número hacia la izquierda.": 198,
    "// Devuelve 1 si al menos uno de tres valores booleanos es verdadero.": 199,
    "// Devuelve 1 si la mayoría de tres valores booleanos son verdaderos.": 200,
    "// Devuelve 1 si tres valores booleanos son todos verdaderos.": 201,
    "// Devuelve el cuadrado de un número.": 202,
    "// Devuelve el cubo de un número.": 203,
    "// Devuelve el elemento central de un arreglo previamente ordenado.": 204,
    "// Devuelve el mayor de dos enteros.": 205,
    "// Devuelve el menor de dos enteros.": 206,
    "// Devuelve el primer elemento de un arreglo.": 207,
    "// Devuelve el primer índice con un valor negativo.": 208,
    "// Devuelve el primer índice con un valor positivo.": 209,
    "// Devuelve el primer índice donde aparece un carácter.": 210,
    "// Devuelve el producto de dos enteros.": 211,
    "// Devuelve el residuo de la división.": 212,
    "// Devuelve el signo de un número.": 213,
    "// Devuelve el valor absoluto.": 214,
    "// Devuelve el valor entero almacenado en la dirección apuntada.": 215,
    "// Devuelve el índice de inicio de la primera aparición de una subcadena.": 216,
    "// Devuelve el índice de la última aparición de una subcadena.": 217,
    "// Devuelve el índice de un valor objetivo.": 218,
    "// Devuelve el último elemento de un arreglo.": 219,
    "// Devuelve el último índice con un valor negativo.": 220,
    "// Devuelve el último índice con un valor positivo.": 221,
    "// Devuelve el último índice donde aparece un carácter.": 222,
    "// Devuelve el último índice donde aparece un valor objetivo.": 223,
    "// Devuelve la diferencia entre dos enteros.": 224,
    "// Devuelve la división entera de dos números.": 225,
    "// Devuelve la suma de dos enteros.": 226,
    "// Disminuye un número en uno.": 227,
    "// Divide los valores apuntados por dos punteros.": 228,
    "// Divide un número por dos usando desplazamiento de bits.": 229,
    "// Elimina los espacios en blanco al final de una cadena.": 230,
    "// Elimina los espacios en blanco al inicio de una cadena.": 231,
    "// Elimina puntos y comas de una cadena.": 232,
    "// Elimina todas las ocurrencias de un carácter específico de una cadena.": 233,
    "// Elimina todos los caracteres numéricos de una cadena.": 234,
    "// Encuentra el segundo valor más grande en un arreglo.": 235,
    "// Encuentra el segundo valor más pequeño en un arreglo.": 236,
    "// Encuentra el valor máximo en un arreglo.": 237,
    "// Encuentra el valor mínimo en un arreglo.": 238,
    "// Encuentra la frecuencia del elemento que más se repite.": 239,
    "// Encuentra la mayor diferencia entre dos elementos adyacentes.": 240,
    "// Encuentra la posición del bit 1 menos significativo.": 241,
    "// Encuentra la posición del bit 1 más significativo.": 242,
    "// Establece un bit específico en un entero.": 243,
    "// Establece un valor en un bloque de memoria simulado con un arreglo.": 244,
    "// Extrae un rango de bits especificado de un número entero.": 245,
    "// Función: arr_alternar_signos": 246,
    "// Función: arr_buscar_indice": 247,
    "// Función: arr_buscar_ultimo_indice": 248,
    "// Función: arr_busqueda_binaria": 249,
    "// Función: arr_clonar_subarreglo": 250,
    "// Función: arr_contar_ceros": 251,
    "// Función: arr_contar_coincidencias": 252,
    "// Función: arr_contar_en_rango": 253,
    "// Función: arr_contar_impares": 254,
    "// Función: arr_contar_mayores_que": 255,
    "// Función: arr_contar_menores_que": 256,
    "// Función: arr_contar_negativos": 257,
    "// Función: arr_contar_no_ceros": 258,
    "// Función: arr_contar_pares": 259,
    "// Función: arr_contar_positivos": 260,
    "// Función: arr_contiene": 261,
    "// Función: arr_copiar": 262,
    "// Función: arr_desplazar_derecha_cero": 263,
    "// Función: arr_desplazar_izquierda_cero": 264,
    "// Función: arr_diferencia_conteo": 265,
    "// Función: arr_diferencia_maxima": 266,
    "// Función: arr_eliminar_elemento": 267,
    "// Función: arr_es_simetrico": 268,
    "// Función: arr_escalar": 269,
    "// Función: arr_esta_ordenado": 270,
    "// Función: arr_frecuencia_maxima": 271,
    "// Función: arr_fusionar_ordenados": 272,
    "// Función: arr_insertar_elemento": 273,
    "// Función: arr_intercambiar_elementos": 274,
    "// Función: arr_interseccion_conteo": 275,
    "// Función: arr_invertir": 276,
    "// Función: arr_llenar_ceros": 277,
    "// Función: arr_llenar_unos": 278,
    "// Función: arr_llenar_valor": 279,
    "// Función: arr_maximo": 280,
    "// Función: arr_mediana_ordenado": 281,
    "// Función: arr_minimo": 282,
    "// Función: arr_multiplicar_elementos": 283,
    "// Función: arr_multiplicar_vectores": 284,
    "// Función: arr_ordenar_burbuja": 285,
    "// Función: arr_ordenar_insercion": 286,
    "// Función: arr_ordenar_seleccion": 287,
    "// Función: arr_primer_elemento": 288,
    "// Función: arr_primer_indice_negativo": 289,
    "// Función: arr_primer_indice_positivo": 290,
    "// Función: arr_producto_punto": 291,
    "// Función: arr_promedio": 292,
    "// Función: arr_rango_valores": 293,
    "// Función: arr_reemplazar_valor": 294,
    "// Función: arr_restar_vectores": 295,
    "// Función: arr_rotar_derecha": 296,
    "// Función: arr_rotar_izquierda": 297,
    "// Función: arr_segundo_maximo": 298,
    "// Función: arr_segundo_minimo": 299,
    "// Función: arr_son_iguales": 300,
    "// Función: arr_subarreglo_suma_maxima": 301,
    "// Función: arr_suma": 302,
    "// Función: arr_suma_impares_indices": 303,
    "// Función: arr_suma_pares_indices": 304,
    "// Función: arr_sumar_escalar": 305,
    "// Función: arr_sumar_vectores": 306,
    "// Función: arr_tiene_duplicados": 307,
    "// Función: arr_ultimo_elemento": 308,
    "// Función: arr_ultimo_indice_negativo": 309,
    "// Función: arr_ultimo_indice_positivo": 310,
    "// Función: bit_alternar": 311,
    "// Función: bit_combinar": 312,
    "// Función: bit_comprobar": 313,
    "// Función: bit_conteo_ceros": 314,
    "// Función: bit_conteo_unos": 315,
    "// Función: bit_desplazar_derecha": 316,
    "// Función: bit_desplazar_izquierda": 317,
    "// Función: bit_dividir_por_dos": 318,
    "// Función: bit_emparejar_bits": 319,
    "// Función: bit_es_impar_bitwise": 320,
    "// Función: bit_es_par_bitwise": 321,
    "// Función: bit_es_potencia_de_dos": 322,
    "// Función: bit_establecer": 323,
    "// Función: bit_extraer_rango": 324,
    "// Función: bit_invertir_mascara": 325,
    "// Función: bit_limpiar": 326,
    "// Función: bit_mas_significativo": 327,
    "// Función: bit_mascara_inferior": 328,
    "// Función: bit_menos_significativo": 329,
    "// Función: bit_multiplicar_por_dos": 330,
    "// Función: bit_rotar_derecha_16": 331,
    "// Función: bit_rotar_derecha_8": 332,
    "// Función: bit_rotar_izquierda_16": 333,
    "// Función: bit_rotar_izquierda_8": 334,
    "// Función: bool_al_menos_uno": 335,
    "// Función: bool_demux_cero": 336,
    "// Función: bool_demux_uno": 337,
    "// Función: bool_equivalencia": 338,
    "// Función: bool_implicacion": 339,
    "// Función: bool_mayoria": 340,
    "// Función: bool_mux": 341,
    "// Función: bool_nand": 342,
    "// Función: bool_no": 343,
    "// Función: bool_nor": 344,
    "// Función: bool_o": 345,
    "// Función: bool_semi_sumador_acarreo": 346,
    "// Función: bool_semi_sumador_suma": 347,
    "// Función: bool_todos_verdaderos": 348,
    "// Función: bool_xor": 349,
    "// Función: bool_y": 350,
    "// Función: cad_a_mayuscula": 351,
    "// Función: cad_a_minuscula": 352,
    "// Función: cad_contar_caracter": 353,
    "// Función: cad_contiene_caracter": 354,
    "// Función: cad_es_digito": 355,
    "// Función: cad_es_letra": 356,
    "// Función: cad_esta_vacia": 357,
    "// Función: cad_longitud": 358,
    "// Función: char_a_entero": 359,
    "// Función: char_es_alfanumerico": 360,
    "// Función: char_es_consonante": 361,
    "// Función: char_es_espacio": 362,
    "// Función: char_es_hexadecimal": 363,
    "// Función: char_es_mayuscula": 364,
    "// Función: char_es_minuscula": 365,
    "// Función: char_es_octal": 366,
    "// Función: char_es_puntuacion": 367,
    "// Función: char_es_vocal": 368,
    "// Función: mat_diagonal_principal_suma": 369,
    "// Función: mat_diagonal_secundaria_suma": 370,
    "// Función: mat_es_identidad": 371,
    "// Función: mat_es_matriz_cero": 372,
    "// Función: mat_suma_total": 373,
    "// Función: mate_absoluto": 374,
    "// Función: mate_cuadrado": 375,
    "// Función: mate_cubo": 376,
    "// Función: mate_decrementar": 377,
    "// Función: mate_dividir": 378,
    "// Función: mate_es_impar": 379,
    "// Función: mate_es_par": 380,
    "// Función: mate_factorial": 381,
    "// Función: mate_incrementar": 382,
    "// Función: mate_limitar": 383,
    "// Función: mate_maximo": 384,
    "// Función: mate_mcd": 385,
    "// Función: mate_mcm": 386,
    "// Función: mate_minimo": 387,
    "// Función: mate_modulo": 388,
    "// Función: mate_multiplicar": 389,
    "// Función: mate_potencia": 390,
    "// Función: mate_restar": 391,
    "// Función: mate_signo": 392,
    "// Función: mate_sumar": 393,
    "// Función: math_angulo_interno_regular": 394,
    "// Función: math_area_circulo_aprox": 395,
    "// Función: math_area_cuadrado": 396,
    "// Función: math_area_hexagono": 397,
    "// Función: math_area_pentagono": 398,
    "// Función: math_area_rectangulo": 399,
    "// Función: math_area_rombo": 400,
    "// Función: math_area_trapecio": 401,
    "// Función: math_area_triangulo": 402,
    "// Función: math_casi_iguales": 403,
    "// Función: math_descuento_comercial": 404,
    "// Función: math_diferencia_absoluta": 405,
    "// Función: math_discriminante_cuadradico": 406,
    "// Función: math_es_cero": 407,
    "// Función: math_es_cuadrado_perfecto": 408,
    "// Función: math_es_cubo_perfecto": 409,
    "// Función: math_es_divisible": 410,
    "// Función: math_es_multiplo": 411,
    "// Función: math_es_negativo": 412,
    "// Función: math_es_positivo": 413,
    "// Función: math_es_primo": 414,
    "// Función: math_es_rentable": 415,
    "// Función: math_ganancia_neta": 416,
    "// Función: math_hipotenusa_cuadrado": 417,
    "// Función: math_interes_simple": 418,
    "// Función: math_media_armonica_simple": 419,
    "// Función: math_monto_total_simple": 420,
    "// Función: math_numero_diagonales": 421,
    "// Función: math_perimetro_circulo_aprox": 422,
    "// Función: math_perimetro_cuadrado": 423,
    "// Función: math_perimetro_rectangulo": 424,
    "// Función: math_perimetro_rombo": 425,
    "// Función: math_perimetro_trapecio": 426,
    "// Función: math_perimetro_triangulo": 427,
    "// Función: math_porcentaje": 428,
    "// Función: math_progresion_aritmetica": 429,
    "// Función: math_progresion_geometrica": 430,
    "// Función: math_punto_equilibrio": 431,
    "// Función: math_raiz_cuadrada": 432,
    "// Función: math_redondear_multiplo": 433,
    "// Función: math_suma_angulos_internos": 434,
    "// Función: math_sumatoria": 435,
    "// Función: math_tiene_raices_reales": 436,
    "// Función: math_variacion_porcentual": 437,
    "// Función: math_volumen_cilindro_aprox": 438,
    "// Función: math_volumen_cubo": 439,
    "// Función: math_volumen_esfera_aprox": 440,
    "// Función: math_volumen_prisma": 441,
    "// Función: mem_buscar_byte": 442,
    "// Función: mem_comparar_bloque": 443,
    "// Función: mem_copiar_bloque": 444,
    "// Función: mem_establecer_bloque": 445,
    "// Función: mem_intercambiar_bloques": 446,
    "// Función: mem_invertir_bloque": 447,
    "// Función: ptr_asignar_valor": 448,
    "// Función: ptr_copiar_valor": 449,
    "// Función: ptr_decrementar_val": 450,
    "// Función: ptr_dividir_valores": 451,
    "// Función: ptr_es_nulo": 452,
    "// Función: ptr_incrementar_val": 453,
    "// Función: ptr_intercambiar": 454,
    "// Función: ptr_modulo_valores": 455,
    "// Función: ptr_multiplicar_valores": 456,
    "// Función: ptr_obtener_valor": 457,
    "// Función: ptr_restar_valores": 458,
    "// Función: ptr_son_direcciones_iguales": 459,
    "// Función: ptr_sumar_desplazamiento": 460,
    "// Función: ptr_sumar_valores": 461,
    "// Función: stat_coeficiente_variacion": 462,
    "// Función: stat_rango_intercuartilico": 463,
    "// Función: str_a_mayusculas": 464,
    "// Función: str_a_minusculas": 465,
    "// Función: str_buscar_caracter": 466,
    "// Función: str_buscar_subcadena": 467,
    "// Función: str_buscar_ultima_subcadena": 468,
    "// Función: str_buscar_ultimo_caracter": 469,
    "// Función: str_cifrar_cesar": 470,
    "// Función: str_comparar": 471,
    "// Función: str_concatenar": 472,
    "// Función: str_contar_consonantes": 473,
    "// Función: str_contar_digitos": 474,
    "// Función: str_contar_espacios": 475,
    "// Función: str_contar_letras": 476,
    "// Función: str_contar_mayusculas": 477,
    "// Función: str_contar_minusculas": 478,
    "// Función: str_contar_puntuacion": 479,
    "// Función: str_contar_subcadenas": 480,
    "// Función: str_contar_vocales": 481,
    "// Función: str_copiar": 482,
    "// Función: str_copiar_n": 483,
    "// Función: str_descifrar_cesar": 484,
    "// Función: str_eliminar_caracter": 485,
    "// Función: str_eliminar_digitos": 486,
    "// Función: str_eliminar_puntuacion": 487,
    "// Función: str_es_anagrama": 488,
    "// Función: str_es_isograma": 489,
    "// Función: str_es_palindromo": 490,
    "// Función: str_es_pangrama_aprox": 491,
    "// Función: str_invertir": 492,
    "// Función: str_invertir_palabras_simples": 493,
    "// Función: str_limpiar_espacios": 494,
    "// Función: str_prefijo": 495,
    "// Función: str_recortar_fin": 496,
    "// Función: str_recortar_inicio": 497,
    "// Función: str_reemplazar_caracter": 498,
    "// Función: str_rellenar_derecha": 499,
    "// Función: str_rellenar_izquierda": 500,
    "// Función: str_son_iguales": 501,
    "// Función: str_sufijo": 502,
    "// Función: str_truncar": 503,
    "// Función: util_generar_secuencia": 504,
    "// Función: util_sumar_condicional": 505,
    "// Fusiona dos arreglos ordenados en un tercer arreglo destino.": 506,
    "// Genera una máscara con los n bits inferiores establecidos en 1.": 507,
    "// Incrementa el valor al que se apunta.": 508,
    "// Intercala los 8 bits inferiores de dos números.": 509,
    "// Intercambia dos elementos en un arreglo.": 510,
    "// Intercambia dos valores enteros usando punteros.": 511,
    "// Intercambia los elementos de dos bloques de memoria simulados.": 512,
    "// Invierte el orden de caracteres dentro de un rango especificado.": 513,
    "// Invierte el orden de los elementos en un bloque de memoria simulado.": 514,
    "// Invierte los bits de un número aplicando una máscara XOR.": 515,
    "// Invierte los caracteres de una cadena en su propio lugar.": 516,
    "// Invierte los elementos de un arreglo en su lugar.": 517,
    "// Limpia un bit específico en un entero.": 518,
    "// Llena un arreglo con ceros.": 519,
    "// Llena un arreglo con un valor específico.": 520,
    "// Llena un arreglo con una secuencia consecutiva de números.": 521,
    "// Llena un arreglo con unos.": 522,
    "// Multiplica dos arreglos elemento por elemento y guarda el resultado.": 523,
    "// Multiplica los valores apuntados por dos punteros.": 524,
    "// Multiplica por -1 los elementos en índices impares.": 525,
    "// Multiplica todos los elementos por un escalar.": 526,
    "// Multiplica un número por dos usando desplazamiento de bits.": 527,
    "// Ordena un arreglo en orden ascendente usando el método de burbuja.": 528,
    "// Ordena un arreglo en orden ascendente usando inserción.": 529,
    "// Ordena un arreglo en orden ascendente usando selección.": 530,
    "// Realiza AND lógico en dos enteros.": 531,
    "// Realiza NOT lógico en un entero.": 532,
    "// Realiza OR lógico en dos enteros.": 533,
    "// Realiza XOR lógico en dos enteros.": 534,
    "// Realiza la implicación lógica.": 535,
    "// Realiza la operación NAND lógica entre dos enteros.": 536,
    "// Realiza la operación NOR lógica entre dos enteros.": 537,
    "// Redondea un número al múltiplo de m más cercano hacia abajo.": 538,
    "// Reemplaza espacios por guiones bajos en una cadena.": 539,
    "// Reemplaza todas las ocurrencias de un valor viejo por uno nuevo.": 540,
    "// Reemplaza un carácter específico por otro en toda la cadena.": 541,
    "// Rellena una cadena por la derecha con un carácter hasta alcanzar una longitud.": 542,
    "// Rellena una cadena por la izquierda con un carácter hasta alcanzar una longitud.": 543,
    "// Resta dos arreglos elemento por elemento y guarda el resultado.": 544,
    "// Resta los valores de dos punteros y devuelve el resultado entero.": 545,
    "// Restringe un valor dentro de un rango.": 546,
    "// Rota los elementos de un arreglo una posición hacia la derecha.": 547,
    "// Rota los elementos de un arreglo una posición hacia la izquierda.": 548,
    "// Rota un entero de 16 bits hacia la derecha.": 549,
    "// Rota un entero de 16 bits hacia la izquierda.": 550,
    "// Rota un entero de 8 bits hacia la derecha.": 551,
    "// Rota un entero de 8 bits hacia la izquierda.": 552,
    "// Simula la salida cero de un demultiplexor de una entrada.": 553,
    "// Simula la salida uno de un demultiplexor de una entrada.": 554,
    "// Simula un multiplexor booleano de dos entradas y una línea de selección.": 555,
    "// Suma dos arreglos elemento por elemento y guarda el resultado.": 556,
    "// Suma dos números solo si una condición booleana es verdadera.": 557,
    "// Suma los elementos de la diagonal principal de una matriz cuadrada.": 558,
    "// Suma los elementos de la diagonal secundaria de una matriz cuadrada.": 559,
    "// Suma los elementos que se encuentran en índices impares.": 560,
    "// Suma los elementos que se encuentran en índices pares.": 561,
    "// Suma los valores de dos punteros y devuelve el resultado entero.": 562,
    "// Suma todos los elementos de una matriz.": 563,
    "// Suma un desplazamiento a un puntero entero y devuelve el nuevo puntero.": 564,
    "// Suma un escalar a todos los elementos del arreglo.": 565,
    "0": 566,
    "1": 567,
    "100": 568,
    "16": 569,
    "180": 570,
    "2": 571,
    "256": 572,
    "26": 573,
    "3": 574,
    "32": 575,
    "4": 576,
    "8": 577,
    ";": 578,
    "<": 579,
    "<<": 580,
    "<=": 581,
    "=": 582,
    "==": 583,
    ">": 584,
    ">=": 585,
    ">>": 586,
    "[": 587,
    "]": 588,
    "^": 589,
    "a": 590,
    "alta_limpia": 591,
    "alto": 592,
    "altura": 593,
    "ancho": 594,
    "apotema": 595,
    "arr": 596,
    "arr_a": 597,
    "arr_alternar_signos": 598,
    "arr_b": 599,
    "arr_buscar_indice": 600,
    "arr_buscar_ultimo_indice": 601,
    "arr_busqueda_binaria": 602,
    "arr_clonar_subarreglo": 603,
    "arr_contar_ceros": 604,
    "arr_contar_coincidencias": 605,
    "arr_contar_en_rango": 606,
    "arr_contar_impares": 607,
    "arr_contar_mayores_que": 608,
    "arr_contar_menores_que": 609,
    "arr_contar_negativos": 610,
    "arr_contar_no_ceros": 611,
    "arr_contar_pares": 612,
    "arr_contar_positivos": 613,
    "arr_contiene": 614,
    "arr_copiar": 615,
    "arr_desplazar_derecha_cero": 616,
    "arr_desplazar_izquierda_cero": 617,
    "arr_diferencia_conteo": 618,
    "arr_diferencia_maxima": 619,
    "arr_eliminar_elemento": 620,
    "arr_es_simetrico": 621,
    "arr_escalar": 622,
    "arr_esta_ordenado": 623,
    "arr_frecuencia_maxima": 624,
    "arr_fusionar_ordenados": 625,
    "arr_insertar_elemento": 626,
    "arr_intercambiar_elementos": 627,
    "arr_interseccion_conteo": 628,
    "arr_invertir": 629,
    "arr_llenar_ceros": 630,
    "arr_llenar_unos": 631,
    "arr_llenar_valor": 632,
    "arr_maximo": 633,
    "arr_mediana_ordenado": 634,
    "arr_minimo": 635,
    "arr_multiplicar_elementos": 636,
    "arr_multiplicar_vectores": 637,
    "arr_ordenar_burbuja": 638,
    "arr_ordenar_insercion": 639,
    "arr_ordenar_seleccion": 640,
    "arr_primer_elemento": 641,
    "arr_primer_indice_negativo": 642,
    "arr_primer_indice_positivo": 643,
    "arr_producto_punto": 644,
    "arr_promedio": 645,
    "arr_rango_valores": 646,
    "arr_reemplazar_valor": 647,
    "arr_restar_vectores": 648,
    "arr_rotar_derecha": 649,
    "arr_rotar_izquierda": 650,
    "arr_segundo_maximo": 651,
    "arr_segundo_minimo": 652,
    "arr_son_iguales": 653,
    "arr_subarreglo_suma_maxima": 654,
    "arr_suma": 655,
    "arr_suma_impares_indices": 656,
    "arr_suma_pares_indices": 657,
    "arr_sumar_escalar": 658,
    "arr_sumar_vectores": 659,
    "arr_tiene_duplicados": 660,
    "arr_ultimo_elemento": 661,
    "arr_ultimo_indice_negativo": 662,
    "arr_ultimo_indice_positivo": 663,
    "b": 664,
    "baja_limpia": 665,
    "base": 666,
    "base_mayor": 667,
    "base_menor": 668,
    "bit_a": 669,
    "bit_alternar": 670,
    "bit_b": 671,
    "bit_combinar": 672,
    "bit_comprobar": 673,
    "bit_conteo_ceros": 674,
    "bit_conteo_unos": 675,
    "bit_desplazar_derecha": 676,
    "bit_desplazar_izquierda": 677,
    "bit_dividir_por_dos": 678,
    "bit_emparejar_bits": 679,
    "bit_es_impar_bitwise": 680,
    "bit_es_par_bitwise": 681,
    "bit_es_potencia_de_dos": 682,
    "bit_establecer": 683,
    "bit_extraer_rango": 684,
    "bit_invertir_mascara": 685,
    "bit_limpiar": 686,
    "bit_mas_significativo": 687,
    "bit_mascara_inferior": 688,
    "bit_menos_significativo": 689,
    "bit_multiplicar_por_dos": 690,
    "bit_rotar_derecha_16": 691,
    "bit_rotar_derecha_8": 692,
    "bit_rotar_izquierda_16": 693,
    "bit_rotar_izquierda_8": 694,
    "bloque": 695,
    "bloque_a": 696,
    "bloque_b": 697,
    "bool_a": 698,
    "bool_al_menos_uno": 699,
    "bool_b": 700,
    "bool_demux_cero": 701,
    "bool_demux_uno": 702,
    "bool_equivalencia": 703,
    "bool_implicacion": 704,
    "bool_mayoria": 705,
    "bool_mux": 706,
    "bool_nand": 707,
    "bool_no": 708,
    "bool_nor": 709,
    "bool_o": 710,
    "bool_semi_sumador_acarreo": 711,
    "bool_semi_sumador_suma": 712,
    "bool_todos_verdaderos": 713,
    "bool_xor": 714,
    "bool_y": 715,
    "c": 716,
    "cad": 717,
    "cad_a": 718,
    "cad_a_mayuscula": 719,
    "cad_a_minuscula": 720,
    "cad_b": 721,
    "cad_contar_caracter": 722,
    "cad_contiene_caracter": 723,
    "cad_es_digito": 724,
    "cad_es_letra": 725,
    "cad_esta_vacia": 726,
    "cad_longitud": 727,
    "cantidad": 728,
    "capital": 729,
    "cateto_a": 730,
    "cateto_b": 731,
    "char": 732,
    "char_a_entero": 733,
    "char_es_alfanumerico": 734,
    "char_es_consonante": 735,
    "char_es_espacio": 736,
    "char_es_hexadecimal": 737,
    "char_es_mayuscula": 738,
    "char_es_minuscula": 739,
    "char_es_octal": 740,
    "char_es_puntuacion": 741,
    "char_es_vocal": 742,
    "clave": 743,
    "coincidencia": 744,
    "columnas": 745,
    "condicion": 746,
    "cont_a": 747,
    "cont_b": 748,
    "costo_variable": 749,
    "costos": 750,
    "costos_fijos": 751,
    "cuenta": 752,
    "descuento": 753,
    "desplazamiento": 754,
    "destino": 755,
    "desviacion": 756,
    "diagonal_mayor": 757,
    "diagonal_menor": 758,
    "dif": 759,
    "dif_max": 760,
    "diferencia": 761,
    "disc": 762,
    "dividendo": 763,
    "divisor": 764,
    "else": 765,
    "encontrado": 766,
    "entrada": 767,
    "entrada_a": 768,
    "entrada_b": 769,
    "exp": 770,
    "factor": 771,
    "filas": 772,
    "fin": 773,
    "for": 774,
    "frecuencia": 775,
    "i": 776,
    "if": 777,
    "indice": 778,
    "indice1": 779,
    "indice2": 780,
    "indice_destino": 781,
    "indice_min": 782,
    "ingresos": 783,
    "inicio": 784,
    "int": 785,
    "interes": 786,
    "j": 787,
    "k": 788,
    "lado": 789,
    "lado_a": 790,
    "lado_b": 791,
    "lado_c": 792,
    "largo": 793,
    "letras": 794,
    "limite_inf": 795,
    "limite_sup": 796,
    "long_cad": 797,
    "long_sub": 798,
    "long_suf": 799,
    "longi": 800,
    "longitud": 801,
    "longitud_final": 802,
    "longitud_maxima": 803,
    "margen": 804,
    "mascara": 805,
    "mat": 806,
    "mat_diagonal_principal_suma": 807,
    "mat_diagonal_secundaria_suma": 808,
    "mat_es_identidad": 809,
    "mat_es_matriz_cero": 810,
    "mat_suma_total": 811,
    "mate_absoluto": 812,
    "mate_cuadrado": 813,
    "mate_cubo": 814,
    "mate_decrementar": 815,
    "mate_dividir": 816,
    "mate_es_impar": 817,
    "mate_es_par": 818,
    "mate_factorial": 819,
    "mate_incrementar": 820,
    "mate_limitar": 821,
    "mate_maximo": 822,
    "mate_mcd": 823,
    "mate_mcm": 824,
    "mate_minimo": 825,
    "mate_modulo": 826,
    "mate_multiplicar": 827,
    "mate_potencia": 828,
    "mate_restar": 829,
    "mate_signo": 830,
    "mate_sumar": 831,
    "math_angulo_interno_regular": 832,
    "math_area_circulo_aprox": 833,
    "math_area_cuadrado": 834,
    "math_area_hexagono": 835,
    "math_area_pentagono": 836,
    "math_area_rectangulo": 837,
    "math_area_rombo": 838,
    "math_area_trapecio": 839,
    "math_area_triangulo": 840,
    "math_casi_iguales": 841,
    "math_descuento_comercial": 842,
    "math_diferencia_absoluta": 843,
    "math_discriminante_cuadradico": 844,
    "math_es_cero": 845,
    "math_es_cuadrado_perfecto": 846,
    "math_es_cubo_perfecto": 847,
    "math_es_divisible": 848,
    "math_es_multiplo": 849,
    "math_es_negativo": 850,
    "math_es_positivo": 851,
    "math_es_primo": 852,
    "math_es_rentable": 853,
    "math_ganancia_neta": 854,
    "math_hipotenusa_cuadrado": 855,
    "math_interes_simple": 856,
    "math_media_armonica_simple": 857,
    "math_monto_total_simple": 858,
    "math_numero_diagonales": 859,
    "math_perimetro_circulo_aprox": 860,
    "math_perimetro_cuadrado": 861,
    "math_perimetro_rectangulo": 862,
    "math_perimetro_rombo": 863,
    "math_perimetro_trapecio": 864,
    "math_perimetro_triangulo": 865,
    "math_porcentaje": 866,
    "math_progresion_aritmetica": 867,
    "math_progresion_geometrica": 868,
    "math_punto_equilibrio": 869,
    "math_raiz_cuadrada": 870,
    "math_redondear_multiplo": 871,
    "math_suma_angulos_internos": 872,
    "math_sumatoria": 873,
    "math_tiene_raices_reales": 874,
    "math_variacion_porcentual": 875,
    "math_volumen_cilindro_aprox": 876,
    "math_volumen_cubo": 877,
    "math_volumen_esfera_aprox": 878,
    "math_volumen_prisma": 879,
    "max": 880,
    "max1": 881,
    "max2": 882,
    "max_actual": 883,
    "max_frecuencia": 884,
    "max_global": 885,
    "media": 886,
    "medio": 887,
    "mem_buscar_byte": 888,
    "mem_comparar_bloque": 889,
    "mem_copiar_bloque": 890,
    "mem_establecer_bloque": 891,
    "mem_intercambiar_bloques": 892,
    "mem_invertir_bloque": 893,
    "min": 894,
    "min1": 895,
    "min2": 896,
    "multiplo": 897,
    "n": 898,
    "nuevo": 899,
    "num": 900,
    "numero": 901,
    "objetivo": 902,
    "origen": 903,
    "parte_alta": 904,
    "parte_baja": 905,
    "perimetro": 906,
    "porcentaje": 907,
    "posicion": 908,
    "posiciones": 909,
    "precio": 910,
    "precio_venta": 911,
    "prefijo": 912,
    "primer_termino": 913,
    "primer_val": 914,
    "producto": 915,
    "ptr": 916,
    "ptr_a": 917,
    "ptr_asignar_valor": 918,
    "ptr_b": 919,
    "ptr_copiar_valor": 920,
    "ptr_decrementar_val": 921,
    "ptr_dividir_valores": 922,
    "ptr_es_nulo": 923,
    "ptr_incrementar_val": 924,
    "ptr_intercambiar": 925,
    "ptr_modulo_valores": 926,
    "ptr_multiplicar_valores": 927,
    "ptr_obtener_valor": 928,
    "ptr_restar_valores": 929,
    "ptr_son_direcciones_iguales": 930,
    "ptr_sumar_desplazamiento": 931,
    "ptr_sumar_valores": 932,
    "q1": 933,
    "q3": 934,
    "radio": 935,
    "razon": 936,
    "relleno": 937,
    "resultado": 938,
    "return": 939,
    "seleccion": 940,
    "stat_coeficiente_variacion": 941,
    "stat_rango_intercuartilico": 942,
    "str_a_mayusculas": 943,
    "str_a_minusculas": 944,
    "str_buscar_caracter": 945,
    "str_buscar_subcadena": 946,
    "str_buscar_ultima_subcadena": 947,
    "str_buscar_ultimo_caracter": 948,
    "str_cifrar_cesar": 949,
    "str_comparar": 950,
    "str_concatenar": 951,
    "str_contar_consonantes": 952,
    "str_contar_digitos": 953,
    "str_contar_espacios": 954,
    "str_contar_letras": 955,
    "str_contar_mayusculas": 956,
    "str_contar_minusculas": 957,
    "str_contar_puntuacion": 958,
    "str_contar_subcadenas": 959,
    "str_contar_vocales": 960,
    "str_copiar": 961,
    "str_copiar_n": 962,
    "str_descifrar_cesar": 963,
    "str_eliminar_caracter": 964,
    "str_eliminar_digitos": 965,
    "str_eliminar_puntuacion": 966,
    "str_es_anagrama": 967,
    "str_es_isograma": 968,
    "str_es_palindromo": 969,
    "str_es_pangrama_aprox": 970,
    "str_invertir": 971,
    "str_invertir_palabras_simples": 972,
    "str_limpiar_espacios": 973,
    "str_prefijo": 974,
    "str_recortar_fin": 975,
    "str_recortar_inicio": 976,
    "str_reemplazar_caracter": 977,
    "str_rellenar_derecha": 978,
    "str_rellenar_izquierda": 979,
    "str_son_iguales": 980,
    "str_sufijo": 981,
    "str_truncar": 982,
    "sub": 983,
    "sufijo": 984,
    "suma": 985,
    "tam_a": 986,
    "tam_b": 987,
    "tamano": 988,
    "tasa": 989,
    "temp": 990,
    "tiempo": 991,
    "tolerancia": 992,
    "total": 993,
    "u_num": 994,
    "ultimo_indice": 995,
    "ultimo_val": 996,
    "umbral": 997,
    "unsigned": 998,
    "util_generar_secuencia": 999,
    "util_sumar_condicional": 1000,
    "val": 1001,
    "val_max": 1002,
    "val_min": 1003,
    "valor": 1004,
    "valor_final": 1005,
    "valor_inicial": 1006,
    "valor_nuevo": 1007,
    "valor_viejo": 1008,
    "viejo": 1009,
    "visto": 1010,
    "void": 1011,
    "while": 1012,
    "xFF": 1013,
    "xFFFF": 1014,
    "{": 1015,
    "|": 1016,
    "||": 1017,
    "}": 1018,
    "~": 1019
  },
  "idx_to_token": {
    "0": "\n",
    "1": " ",
    "2": "    ",
    "3": "!",
    "4": "!=",
    "5": "%",
    "6": "&",
    "7": "&&",
    "8": "' '",
    "9": "'!'",
    "10": "','",
    "11": "'.'",
    "12": "'0'",
    "13": "'7'",
    "14": "'9'",
    "15": "':'",
    "16": "';'",
    "17": "'?'",
    "18": "'A'",
    "19": "'E'",
    "20": "'F'",
    "21": "'I'",
    "22": "'O'",
    "23": "'U'",
    "24": "'Z'",
    "25": "'\\0'",
    "26": "'\\n'",
    "27": "'\\r'",
    "28": "'\\t'",
    "29": "'_'",
    "30": "'a'",
    "31": "'e'",
    "32": "'f'",
    "33": "'i'",
    "34": "'o'",
    "35": "'u'",
    "36": "'z'",
    "37": "(",
    "38": ")",
    "39": "*",
    "40": "+",
    "41": "++",
    "42": ",",
    "43": "-",
    "44": "--",
    "45": "/",
    "46": "// Agrega el contenido de una cadena al final de otra cadena destino.",
    "47": "// Alterna un bit específico en un entero.",
    "48": "// Asigna un valor entero a la dirección de memoria apuntada.",
    "49": "// Aumenta un número en uno.",
    "50": "// Busca un valor en un arreglo ordenado usando búsqueda binaria.",
    "51": "// Busca un valor específico en un bloque de memoria simulado.",
    "52": "// Calcula el bit de acarreo de un semisumador.",
    "53": "// Calcula el bit de suma de un semisumador.",
    "54": "// Calcula el coeficiente de variación porcentual aproximado.",
    "55": "// Calcula el cuadrado de la hipotenusa de un triángulo rectángulo.",
    "56": "// Calcula el discriminante de una ecuación de segundo grado.",
    "57": "// Calcula el factorial de un número.",
    "58": "// Calcula el interés simple acumulado.",
    "59": "// Calcula el monto total con interés simple.",
    "60": "// Calcula el máximo común divisor.",
    "61": "// Calcula el mínimo común múltiplo.",
    "62": "// Calcula el módulo de los valores apuntados por dos punteros.",
    "63": "// Calcula el n-ésimo término de una progresión aritmética.",
    "64": "// Calcula el n-ésimo término de una progresión geométrica.",
    "65": "// Calcula el número de diagonales de un polígono de n lados.",
    "66": "// Calcula el perímetro aproximado de un círculo usando pi como 3.",
    "67": "// Calcula el perímetro de un cuadrado.",
    "68": "// Calcula el perímetro de un rectángulo.",
    "69": "// Calcula el perímetro de un rombo.",
    "70": "// Calcula el perímetro de un trapecio.",
    "71": "// Calcula el perímetro de un triángulo.",
    "72": "// Calcula el porcentaje de una cantidad.",
    "73": "// Calcula el precio final tras aplicar un porcentaje de descuento.",
    "74": "// Calcula el producto de todos los elementos de un arreglo.",
    "75": "// Calcula el producto punto de dos arreglos.",
    "76": "// Calcula el promedio de los elementos del arreglo.",
    "77": "// Calcula el volumen aproximado de un cilindro usando pi como 3.",
    "78": "// Calcula el volumen aproximado de una esfera usando pi como 3.",
    "79": "// Calcula el volumen de un cubo.",
    "80": "// Calcula el volumen de un prisma rectangular.",
    "81": "// Calcula el ángulo interno de un polígono regular de n lados.",
    "82": "// Calcula el área aproximada de un círculo usando pi como 3.",
    "83": "// Calcula el área de un cuadrado.",
    "84": "// Calcula el área de un hexágono regular.",
    "85": "// Calcula el área de un pentágono regular.",
    "86": "// Calcula el área de un rectángulo.",
    "87": "// Calcula el área de un rombo.",
    "88": "// Calcula el área de un trapecio.",
    "89": "// Calcula el área de un triángulo.",
    "90": "// Calcula la cantidad de unidades para el punto de equilibrio.",
    "91": "// Calcula la diferencia absoluta entre dos números.",
    "92": "// Calcula la diferencia entre el tercer y primer cuartil.",
    "93": "// Calcula la diferencia entre el valor máximo y el valor mínimo del arreglo.",
    "94": "// Calcula la ganancia neta restando costos de ingresos.",
    "95": "// Calcula la longitud de una cadena de texto.",
    "96": "// Calcula la media armónica aproximada de dos enteros.",
    "97": "// Calcula la potencia de una base.",
    "98": "// Calcula la raíz cuadrada entera aproximada.",
    "99": "// Calcula la suma de los elementos del arreglo.",
    "100": "// Calcula la suma de los primeros n números naturales.",
    "101": "// Calcula la suma de los ángulos internos de un polígono de n lados.",
    "102": "// Calcula la suma máxima de un subarreglo contiguo.",
    "103": "// Calcula la variación porcentual entre dos valores.",
    "104": "// Cifra una cadena aplicando un desplazamiento César a las letras minúsculas.",
    "105": "// Combina los 16 bits inferiores de dos números en un solo entero.",
    "106": "// Compara dos bloques de memoria simulados entero a entero.",
    "107": "// Compara dos cadenas alfabéticamente.",
    "108": "// Comprueba si dos arreglos tienen los mismos elementos en el mismo orden.",
    "109": "// Comprueba si dos cadenas son exactamente iguales.",
    "110": "// Comprueba si dos cadenas tienen los mismos caracteres con la misma frecuencia.",
    "111": "// Comprueba si dos números están dentro de un margen de tolerancia.",
    "112": "// Comprueba si dos punteros apuntan a la misma dirección de memoria.",
    "113": "// Comprueba si dos valores de verdad son equivalentes.",
    "114": "// Comprueba si el arreglo es simétrico.",
    "115": "// Comprueba si hay al menos un elemento duplicado en el arreglo.",
    "116": "// Comprueba si los ingresos superan estrictamente a los costos.",
    "117": "// Comprueba si todos los elementos de una matriz son cero.",
    "118": "// Comprueba si un arreglo está ordenado ascendentemente.",
    "119": "// Comprueba si un bit específico está establecido.",
    "120": "// Comprueba si un carácter es letra o dígito.",
    "121": "// Comprueba si un carácter es un dígito octal válido.",
    "122": "// Comprueba si un carácter es un espacio en blanco o tabulación.",
    "123": "// Comprueba si un carácter es un número.",
    "124": "// Comprueba si un carácter es un signo de puntuación básico.",
    "125": "// Comprueba si un carácter es una letra mayúscula.",
    "126": "// Comprueba si un carácter es una letra minúscula.",
    "127": "// Comprueba si un carácter es una letra.",
    "128": "// Comprueba si un carácter es válido en base hexadecimal.",
    "129": "// Comprueba si un carácter existe en una cadena.",
    "130": "// Comprueba si un carácter individual es una consonante.",
    "131": "// Comprueba si un carácter individual es una vocal.",
    "132": "// Comprueba si un entero positivo es una potencia de dos.",
    "133": "// Comprueba si un número entero es primo.",
    "134": "// Comprueba si un número entero es un cuadrado perfecto.",
    "135": "// Comprueba si un número entero es un cubo perfecto.",
    "136": "// Comprueba si un número es divisible por otro.",
    "137": "// Comprueba si un número es estrictamente negativo.",
    "138": "// Comprueba si un número es estrictamente positivo.",
    "139": "// Comprueba si un número es igual a cero.",
    "140": "// Comprueba si un número es impar usando operaciones de bits.",
    "141": "// Comprueba si un número es impar.",
    "142": "// Comprueba si un número es múltiplo de otro.",
    "143": "// Comprueba si un número es par usando operaciones de bits.",
    "144": "// Comprueba si un número es par.",
    "145": "// Comprueba si un puntero es nulo.",
    "146": "// Comprueba si un valor existe en un arreglo.",
    "147": "// Comprueba si una cadena comienza con un prefijo específico.",
    "148": "// Comprueba si una cadena contiene al menos 26 letras alfabéticas distintas.",
    "149": "// Comprueba si una cadena de texto está vacía.",
    "150": "// Comprueba si una cadena no tiene letras repetidas.",
    "151": "// Comprueba si una cadena se lee igual de izquierda a derecha que al revés.",
    "152": "// Comprueba si una cadena termina con un sufijo específico.",
    "153": "// Comprueba si una ecuación cuadrática tiene raíces reales.",
    "154": "// Comprueba si una matriz cuadrada es una matriz identidad.",
    "155": "// Convierte todos los caracteres de una cadena a mayúsculas.",
    "156": "// Convierte todos los caracteres de una cadena a minúsculas.",
    "157": "// Convierte un carácter a mayúscula.",
    "158": "// Convierte un carácter a minúscula.",
    "159": "// Convierte un carácter numérico a su valor entero.",
    "160": "// Copia como máximo n caracteres de origen a destino.",
    "161": "// Copia datos de un bloque origen a un destino simulado con arreglos.",
    "162": "// Copia el contenido de una cadena origen a una cadena destino.",
    "163": "// Copia el valor de una dirección de memoria a otra.",
    "164": "// Copia elementos de origen a destino.",
    "165": "// Copia una porción de un arreglo origen a un arreglo destino.",
    "166": "// Corta una cadena a una longitud máxima especificada.",
